{
  "items": [
    {
      "description": "This project would not be possible without the generous support of our sponsors.\nIf you also want to support this project, head over to our Github sponsors page.",
      "items": [],
      "title": "Sponsors"
    },
    {
      "description": "",
      "items": [],
      "title": "Table of Contents"
    },
    {
      "description": "",
      "items": [],
      "title": "Multiple Languages"
    },
    {
      "description": "",
      "items": [
        {
          "children": [],
          "description": "Asynchronous Lint Engine for Vim and NeoVim with support for many languages.",
          "title": "ale",
          "repo_info": {
            "archived": false,
            "language": "Vim Script",
            "last_commit": "2026-02-12T00:25:08Z",
            "owner": "w0rp",
            "repo": "ale",
            "stars": 13963
          }
        },
        {
          "children": [],
          "description": "Based on IntelliJ IDEA, and comes bundled with tools for Android including Android Lint.",
          "title": "Android Studio"
        },
        {
          "children": [],
          "description": "copyright: — Static analysis for C/C++/C#, PHP and Java.",
          "title": "AppChecker"
        },
        {
          "children": [],
          "description": "copyright: — Commercial Static Code Analysis which generates exploits to verify vulnerabilities.",
          "title": "Application Inspector"
        },
        {
          "children": [],
          "description": "Creates reports of over 400 rule patterns for feature detection (e.g. the use of cryptography or version control in apps).",
          "title": "ApplicationInspector",
          "repo_info": {
            "archived": false,
            "language": "C#",
            "last_commit": "2026-02-14T20:47:05Z",
            "owner": "microsoft",
            "repo": "ApplicationInspector",
            "stars": 4383
          }
        },
        {
          "children": [],
          "description": "Unit test your Java or Kotlin architecture.",
          "title": "ArchUnit"
        },
        {
          "children": [],
          "description": "ast-grep is a powerful tool designed for managing code at scale using Abstract Syntax Trees (AST). Think of it as a hybrid of grep, eslint, and codemod, with the ability to search, lint, and rewrite code based on its structure rather than plain text.\nIt supports multiple languages and is designed to be extensible, allowing you to register custom languages.",
          "title": "ast-grep"
        },
        {
          "children": [],
          "description": "warning: — Beautify HTML, CSS, JavaScript, PHP, Python, Ruby, Java, C, C++, C#, Objective-C, CoffeeScript, TypeScript, Coldfusion, SQL, and more in Atom editor.",
          "title": "Atom-Beautify :warning: — Beautify HTML, CSS, JavaScript, PHP, Python, Ruby, Java, C, C++, C#, Objective-C, CoffeeScript, TypeScript, Coldfusion, SQL, and more in Atom editor."
        },
        {
          "children": [],
          "description": "A linter and formatter to help you to improve copywriting, correct spaces, words, punctuations between CJK (Chinese, Japanese, Korean).",
          "title": "autocorrect"
        },
        {
          "children": [],
          "description": "copyright: — Tracks down error-prone code locations, style violations, cloned or dead code, cyclic dependencies and more for C/C++, C#/.NET, Java and Ada 83/Ada 95.",
          "title": "Axivion Bauhaus Suite"
        },
        {
          "children": [],
          "description": "Open-Source static code analysis tool to discover,  filter and prioritize security risks and vulnerabilities  leading to sensitive data exposures (PII, PHI, PD).  Highly configurable and easily extensible,  built for security and engineering teams.",
          "title": "Bearer",
          "repo_info": {
            "archived": false,
            "language": "Go",
            "last_commit": "2026-02-09T02:33:48Z",
            "owner": "bearer",
            "repo": "bearer",
            "stars": 2560
          }
        },
        {
          "children": [],
          "description": "copyright: — Better Code Hub checks your GitHub codebase against 10 engineering guidelines devised by the authority in software quality, Software Improvement Group.",
          "title": "Better Code Hub"
        },
        {
          "children": [],
          "description": "warning: — Checks your code and infra (various Git repositories supported, cloud stacks, CLI, Web Interface platform, integrationss available) for security and quality issues. Code Scanning/SAST/Linting using many tools/Scanners deduplicated with One Report (AI optional).",
          "title": "Betterscan CE :warning: — Checks your code and infra (various Git repositories supported, cloud stacks, CLI, Web Interface platform, integrationss available) for security and quality issues. Code Scanning/SAST/Linting using many tools/Scanners deduplicated with One Report (AI optional)."
        },
        {
          "children": [],
          "description": "A toolchain for web projects, aimed to provide functionalities to maintain them. Biome formats and lints code in a fraction of a second. It is the successor to Rome. It is designed to eventually replace Biome is designed to eventually replace Babel, ESLint, webpack, Prettier, Jest, and others.",
          "title": "biome"
        },
        {
          "children": [],
          "description": "A language-agnostic linter that keeps code, documentation, and configuration in sync and enforces strict formatting and validation rules.",
          "title": "BlockWatch",
          "repo_info": {
            "archived": false,
            "language": "Rust",
            "last_commit": "2026-02-13T04:49:03Z",
            "owner": "mennanov",
            "repo": "blockwatch",
            "stars": 22
          }
        },
        {
          "children": [],
          "description": "warning: :copyright: — BugProve is a firmware analysis platform featuring both static and dynamic analysis techniques to discover memory corruptions, command injections and other classes or common weaknesses in binary code. It also detects vulnerable dependencies, weak cryptographic parameters, misconfigurations, and more.",
          "title": "BugProve :warning: :copyright: — BugProve is a firmware analysis platform featuring both static and dynamic analysis techniques to discover memory corruptions, command injections and other classes or common weaknesses in binary code. It also detects vulnerable dependencies, weak cryptographic parameters, misconfigurations, and more."
        },
        {
          "children": [],
          "description": "Statically generates a call graph image and displays it on screen.",
          "title": "callGraph",
          "repo_info": {
            "archived": false,
            "language": "Perl",
            "last_commit": "2024-11-20T02:51:11Z",
            "owner": "koknat",
            "repo": "callGraph",
            "stars": 325
          }
        },
        {
          "children": [],
          "description": "copyright: — Commercial Static Code Analysis which runs locally, but uploads the results to its cloud for presentation.",
          "title": "CAST Highlight"
        },
        {
          "children": [],
          "description": "copyright: — Commercial Static Code Analysis which doesn't require pre-compilation.",
          "title": "Checkmarx CxSAST"
        },
        {
          "children": [],
          "description": "A classpath and module path scanner for querying or visualizing class metadata or class relatedness.",
          "title": "ClassGraph",
          "repo_info": {
            "archived": false,
            "language": "Java",
            "last_commit": "2025-10-10T10:05:26Z",
            "owner": "classgraph",
            "repo": "classgraph",
            "stars": 2956
          }
        },
        {
          "children": [],
          "description": "copyright: — AI-powered code reviews for Salesforce. Secure your developments, enforce best practice and control your technical debt in real-time.",
          "title": "Clayton"
        },
        {
          "children": [],
          "description": "warning: — Language independent framework for creating code analysis - supports over 60 languages by default.",
          "title": "coala :warning: — Language independent framework for creating code analysis - supports over 60 languages by default."
        },
        {
          "children": [],
          "description": "copyright: — Structural source code analyzer by NASA's Jet Propulsion Laboratory.",
          "title": "Cobra"
        },
        {
          "children": [],
          "description": "copyright: — Code Analysis to ship Better Code, Faster.",
          "title": "Codacy"
        },
        {
          "children": [],
          "description": "copyright: — CI/CD-agnostic DevSecOps platform which combines industry-leading fuzzing engines for finding bugs and visualizing code coverage",
          "title": "Code Intelligence"
        },
        {
          "children": [],
          "description": "copyright: — Automated code review tool integrates with GitHub, Bitbucket and GitLab (even self-hosted). Available for JavaScript, TypeScript, Python, Ruby, Go, PHP, Java, Docker, and more. (open-source free)",
          "title": "Codeac"
        },
        {
          "children": [],
          "description": "Provides a unified interface to sort and act on the issues it finds.",
          "title": "codeburner"
        },
        {
          "children": [],
          "description": "A defect database and viewer extension for the Clang Static Analyzer with web GUI.",
          "title": "codechecker"
        },
        {
          "children": [],
          "description": "copyright: — Automated Code Analysis for repos on GitHub or BitBucket.",
          "title": "CodeFactor"
        },
        {
          "children": [],
          "description": "copyright: — Automated code analysis tool to deal with technical depth. Integrates with Bitbucket and Gitlab. (free for Open Source Projects)",
          "title": "CodeFlow"
        },
        {
          "children": [],
          "description": "copyright: — CodeIt.Right™ provides a fast, automated way to ensure that your source code adheres to (your) predefined design and style guidelines as well as best coding practices.",
          "title": "CodeIt.Right"
        },
        {
          "children": [],
          "description": "Codemodder is a pluggable framework for building expressive codemods. Use Codemodder when you need more than a linter or code formatting tool. Use it to fix non-trivial security issues and other code quality problems.",
          "title": "Codemodder"
        },
        {
          "children": [],
          "description": "Deep code analysis - semantic queries and dataflow for several languages with VSCode plugin support.",
          "title": "codeql",
          "repo_info": {
            "archived": false,
            "language": "CodeQL",
            "last_commit": "2026-02-13T11:23:47Z",
            "owner": "github",
            "repo": "codeql",
            "stars": 9234
          }
        },
        {
          "children": [],
          "description": "Ecosystem for structural matching JavaScript and TypeScript code. Offers search tool that understands code structure. Available as CLI tool and Visual Studio Code extension. It helps to search code faster and more accurately making you workflow more effective. Soon it will offer ESLint plugin to create your own rules in minutes to help with assuring codebase quality.",
          "title": "CodeQue"
        },
        {
          "children": [],
          "description": "copyright: — Code creation, debugging, navigation, refactoring, analysis and visualization tools that use the Roslyn engine in Visual Studio 2015 and up.",
          "title": "CodeRush"
        },
        {
          "children": [],
          "description": "copyright: — Code Quality and Security for Salesforce Developers. Made exclusively for the Salesforce platform, CodeScan’s code analysis solutions provide you with total visibility into your code health.",
          "title": "CodeScan"
        },
        {
          "children": [],
          "description": "copyright: — CodeScene is a quality visualization tool for software. Prioritize technical debt, detect delivery risks, and measure organizational aspects. Fully automated.",
          "title": "CodeScene"
        },
        {
          "children": [],
          "description": "copyright: — CodeSee is mapping and automating your app's services, directories, file dependencies, and code changes. It's like Google Map, but for code.t",
          "title": "CodeSee"
        },
        {
          "children": [],
          "description": "copyright: — Advanced, whole program, deep path, static analysis of C, C++, Java and C# with easy-to-understand explanations and code and path visualization.",
          "title": "CodeSonar from GrammaTech"
        },
        {
          "children": [],
          "description": "copyright: — Codety Scanner is a comprehensive source code scanner that embeds 5000+ static code analysis rules, which aim to detect code issues for 20+ programming languages and IaC tools.",
          "title": "Codety"
        },
        {
          "children": [],
          "description": "copyright: — Automated Code Reviews and Technical Debt management platform that supports 12+ languages.",
          "title": "Codiga"
        },
        {
          "children": [],
          "description": "copyright: — Corgea is an AI-powered SAST scanner that helps developers find and fix insecure code.  It finds business logic flaws, broken authentication, API vulnerabilities, and more with little false positives. Additionally, it automatically writes security fixes for them to approve.  Corgea integrates with GitHub, GitLab, Azure DevOps, IDEs and CLI. It is free to try it.",
          "title": "Corgea"
        },
        {
          "children": [],
          "description": "warning: — Semi-automatic translation from C to Rust. Could reveal bugs in the original implementation by showing Rust compiler warnings and errors. Superseded by C2Rust.",
          "title": "Corrode :warning: — Semi-automatic translation from C to Rust. Could reveal bugs in the original implementation by showing Rust compiler warnings and errors. Superseded by C2Rust."
        },
        {
          "children": [],
          "description": "copyright: — Synopsys Coverity supports 20 languages and over 70 frameworks including Ruby on rails, Scala, PHP, Python, JavaScript, TypeScript, Java, Fortran, C, C++, C#, VB.NET.",
          "title": "Coverity"
        },
        {
          "children": [],
          "description": "A Github Action for linting C/C++ code integrating clang-tidy and clang-format to collect feedback provided in the form of thread comments and/or annotations.",
          "title": "cpp-linter-action"
        },
        {
          "children": [],
          "description": "warning: — Check your code quality for js, jsx, vue, css, less, scss, sass and styl files.",
          "title": "cqc :warning: — Check your code quality for js, jsx, vue, css, less, scss, sass and styl files."
        },
        {
          "children": [],
          "description": "warning: :copyright: — DeepCode was acquired by Snyk is now Snyk Code.",
          "title": "DeepCode :warning: :copyright: — DeepCode was acquired by Snyk is now Snyk Code."
        },
        {
          "children": [],
          "description": "copyright: — In-depth static analysis to find issues in verticals of bug risks, security, anti-patterns, performance, documentation and style. Native integrations with GitHub, GitLab and Bitbucket. Less than 5% false positives.",
          "title": "DeepSource"
        },
        {
          "children": [],
          "description": "copyright: — Deleaker is a memory leak detection tool for C++, .NET, and Delphi, integrating with Visual Studio, Qt Creator, and RAD Studio or running as a standalone application. It helps developers find and fix memory, GDI, and handle leaks efficiently.",
          "title": "deleaker"
        },
        {
          "children": [],
          "description": "Analyses the comprehensive dependencies of code elements for Java, C/C++, Ruby.",
          "title": "Depends",
          "repo_info": {
            "archived": false,
            "language": "Java",
            "last_commit": "2026-02-10T13:27:06Z",
            "owner": "multilang-depends",
            "repo": "depends",
            "stars": 242
          }
        },
        {
          "children": [],
          "description": "copyright: — Multi-language Static Application Security Testing (SAST) platform that detects critical vulnerabilities, including hardcoded secrets, weak cryptography, backdoors, SQL injections, insecure configurations, etc.",
          "title": "DerScanner"
        },
        {
          "children": [],
          "description": "Regex-based static analysis tool for Visual Studio, VS Code, and Sublime Text - C/C++, C#, PHP, ASP, Python, Ruby, Java, and others.",
          "title": "DevSkim",
          "repo_info": {
            "archived": false,
            "language": "C#",
            "last_commit": "2026-02-14T12:43:44Z",
            "owner": "microsoft",
            "repo": "devskim",
            "stars": 971
          }
        },
        {
          "children": [],
          "description": "A code formatter for .NET. Preferences will be read from an  file, if present, otherwise a default set of preferences will be used. At this time dotnet-format is able to format C# and Visual Basic projects with a subset of supported  options.",
          "title": "dotnet-format",
          "repo_info": {
            "archived": false,
            "language": null,
            "last_commit": "2026-02-12T21:53:08Z",
            "owner": "dotnet",
            "repo": "format",
            "stars": 1947
          }
        },
        {
          "children": [],
          "description": "copyright: — Intelligent software analytics platform that identifies design issues, code issues, duplication and metrics. Supports Java, C, C++, C#, JavaScript, TypeScript, Python, Go, Kotlin and more.",
          "title": "Embold"
        },
        {
          "children": [],
          "description": "warning: — Emerge is a source code and dependency visualizer that can be used to gather insights about source code structure, metrics, dependencies and complexity of software projects. After scanning the source code of a project it provides you an interactive web interface to explore and analyze your project by using graph structures.",
          "title": "emerge :warning: — Emerge is a source code and dependency visualizer that can be used to gather insights about source code structure, metrics, dependencies and complexity of software projects. After scanning the source code of a project it provides you an interactive web interface to explore and analyze your project by using graph structures."
        },
        {
          "children": [],
          "description": "copyright: — Enforster AI performs Contextual Code Security SAST, leveraging LLMs and artificial intelligence to reduce  and enrich the detection of Logic Flaws, Secrets, Data leaks, Supply chain and technical vulnerabilities.",
          "title": "Enforster AI"
        },
        {
          "children": [],
          "description": "An extensible linter for JS, following the ECMAScript standard.",
          "title": "ESLint",
          "repo_info": {
            "archived": false,
            "language": "JavaScript",
            "last_commit": "2026-02-14T10:29:07Z",
            "owner": "eslint",
            "repo": "eslint",
            "stars": 26896
          }
        },
        {
          "children": [],
          "description": "A JavaScript compiler and TypeScript checker written in Rust with a focus on static analysis and runtime performance. Ezno's type checker is built from scratch.  The checker is fully compatible with TypeScript type annotations and can work without any type annotations at all.",
          "title": "ezno"
        },
        {
          "children": [],
          "description": "The SpotBugs plugin for security audits of Java web applications and Android applications. (Also work with Kotlin, Groovy and Scala projects)",
          "title": "Find Security Bugs"
        },
        {
          "children": [],
          "description": "copyright: — A commercial static analysis platform that supports the scanning of C/C++, C#, VB.NET, VB6, ABAP/BSP, ActionScript, Apex, ASP.NET, Classic ASP, VB Script, Cobol, ColdFusion, HTML, Java, JS, JSP, MXML/Flex, Objective-C, PHP, PL/SQL, T-SQL, Python (2.6, 2.7), Ruby (1.9.3), Swift, Scala, VB, and XML.",
          "title": "Fortify"
        },
        {
          "children": [],
          "description": "The Code Explorer mode in Freeplane is designed for analyzing the structure and dependencies  of code compiled to JVM class files.  It also allows displaying ArchUnit test results directly in Freeplane,  if Freeplane is running and ArchUnit detects rule violations during the tests.",
          "title": "Freeplane Code Explorer"
        },
        {
          "children": [],
          "description": "Regexp based customizable linter.",
          "title": "Goodcheck"
        },
        {
          "children": [],
          "description": "warning: — Finds N+1 queries (SQL calls in a for loop) in go code",
          "title": "goone :warning: — Finds N+1 queries (SQL calls in a for loop) in go code"
        },
        {
          "children": [],
          "description": "Grep rough audit - source code auditing tool.",
          "title": "graudit"
        },
        {
          "children": [],
          "description": "copyright: — Commercial Static Code Analysis.",
          "title": "HCL AppScan Source"
        },
        {
          "children": [],
          "description": "warning: — A static analysis tool written in scala for languages that run on JVM.",
          "title": "Hopper :warning: — A static analysis tool written in scala for languages that run on JVM."
        },
        {
          "children": [],
          "description": "Comments on style violations in GitHub pull requests. Supports Coffeescript, Go, HAML, JavaScript, Ruby, SCSS and Swift.",
          "title": "Hound CI"
        },
        {
          "children": [],
          "description": "warning: — Comment on commits coming into your repository and check for syntactic errors and general lint warnings.",
          "title": "imhotep :warning: — Comment on commits coming into your repository and check for syntactic errors and general lint warnings."
        },
        {
          "children": [],
          "description": "warning: — A multi-language static analyzer for C/C++/Obj-C/Python/Ruby to create a graph (in dot or graphml format) which shows all  relations of a given set of files.",
          "title": "include-gardener :warning: — A multi-language static analyzer for C/C++/Obj-C/Python/Ruby to create a graph (in dot or graphml format) which shows all relations of a given set of files."
        },
        {
          "children": [],
          "description": "A static analyzer for Java, C and Objective-C",
          "title": "Infer"
        },
        {
          "children": [],
          "description": "Joern is a platform for analyzing source code, bytecode, and binary executables. It generates code property graphs (CPGs), a graph representation of code for cross-language code analysis. Code property graphs are stored in a custom graph database. This allows code to be mined using search queries formulated in a Scala-based domain-specific query language. Joern is developed with the goal of providing a useful tool for vulnerability discovery and research in static program analysis.",
          "title": "Joern"
        },
        {
          "children": [],
          "description": "Keploy is an open-source testing platform that helps developers automate and streamline their testing process. It provides API, and integration testing agents, generating tests, mocks/stubs for APIs that actually work. Additionally, Keploy offers an AI-powered Unit Testing Agent that generates stable, useful unit tests directly in your GitHub PRs and in VSCode, helping catch errors and improve code quality.",
          "title": "keploy"
        },
        {
          "children": [],
          "description": "copyright: — Identify and remediate cyber threats in a blazingly fast, collaborative environment, with seamless integration in your SDLC. Python, C\\C++, Java, C#, PHP and more.",
          "title": "Kiuwan"
        },
        {
          "children": [],
          "description": "copyright: — Quality and Security Static analysis for C/C++, Java and C#.",
          "title": "Klocwork"
        },
        {
          "children": [],
          "description": "Automated translation platform for code comments and docstrings across 20+ file types. Eliminates language barriers in international software collaboration. Supports 100+ language pairs with syntax protection. Integrates into CI/CD pipelines like Ruff. 10-20x faster with concurrent processing.",
          "title": "LangLint",
          "repo_info": {
            "archived": false,
            "language": "Rust",
            "last_commit": "2025-12-17T03:37:47Z",
            "owner": "HzaCode",
            "repo": "Langlint",
            "stars": 32
          }
        },
        {
          "children": [],
          "description": "copyright: — Find security vulnerabilities, variants, and critical code quality issues using CodeQL queries over source code. Automatic PR code review; free for open source. Formerly semmle. It supports public Git repositories hosted on Bitbucket Cloud, GitHub.com, GitLab.com.",
          "title": "LGTM"
        },
        {
          "children": [],
          "description": "Lizard is an extensible Cyclomatic Complexity Analyzer for many programming languages  including C/C++ (doesn't require all the header files or Java imports).  It also does copy-paste detection (code clone detection/code duplicate detection) and many other forms of static code analysis. Counts lines of code without comments, CCN (cyclomatic complexity number), token count of functions, parameter count of functions.",
          "title": "lizard",
          "repo_info": {
            "archived": false,
            "language": "Python",
            "last_commit": "2026-02-03T09:50:26Z",
            "owner": "terryyin",
            "repo": "lizard",
            "stars": 2269
          }
        },
        {
          "children": [],
          "description": "Mega-Linter can handle any type of project thanks to its 70+ embedded Linters,\nits advanced reporting, runnable on any CI system or locally,\nwith assisted installation and configuration, able to apply formatting and fixes",
          "title": "Mega-Linter"
        },
        {
          "children": [],
          "description": "copyright: — Mobb is a trusted, automatic vulnerability fixer that secures applications, reduces security backlogs,  and frees developers to focus on innovation. Mobb is free for open-source projects.",
          "title": "Mobb"
        },
        {
          "children": [],
          "description": "A static analyzer designed to easily reuse abstract domains across widely different languages (such as C and Python).",
          "title": "MOPSA"
        },
        {
          "children": [],
          "description": "warning: — A static source code analysis tool to improve quality and reduce defects for C, C++ and Objective-C.",
          "title": "oclint :warning: — A static source code analysis tool to improve quality and reduce defects for C, C++ and Objective-C."
        },
        {
          "children": [],
          "description": "copyright: — Commercial Static Code Analysis system doesn't require building the source code or pre-compilation.",
          "title": "Offensive 360"
        },
        {
          "children": [],
          "description": "OpenRewrite   reported through Sonar and other tools using a Maven and Gradle plugin or the Moderne CLI.",
          "title": "OpenRewrite"
        },
        {
          "children": [],
          "description": "OpenStaticAnalyzer is a source code analyzer tool, which can perform deep static analysis of the source code of complex systems.",
          "title": "OpenStaticAnalyzer",
          "repo_info": {
            "archived": false,
            "language": "C++",
            "last_commit": "2022-11-09T15:32:11Z",
            "owner": "sed-inf-u-szeged",
            "repo": "OpenStaticAnalyzer",
            "stars": 48
          }
        },
        {
          "children": [],
          "description": "The Oxidation Compiler is creating a suite of high-performance tools for the JavaScript / TypeScript language re-written in Rust.",
          "title": "oxc",
          "repo_info": {
            "archived": false,
            "language": "Rust",
            "last_commit": "2026-02-15T00:02:10Z",
            "owner": "web-infra-dev",
            "repo": "oxc",
            "stars": 18981
          }
        },
        {
          "children": [],
          "description": "copyright: — Automated Software Testing Solutions for unit-, API-, and web UI testing. Complies with MISRA, OWASP, and others.",
          "title": "parasoft"
        },
        {
          "children": [],
          "description": "Facebook's tools for code analysis, visualizations, or style-preserving source transformation for many languages.",
          "title": "pfff",
          "repo_info": {
            "archived": true,
            "language": "OCaml",
            "last_commit": "2019-03-27T23:04:23Z",
            "owner": "facebookarchive",
            "repo": "pfff",
            "stars": 2439
          }
        },
        {
          "children": [],
          "description": "copyright: — Pixeebot finds security and code quality issues in your code and creates merge-ready pull requests with recommended fixes.",
          "title": "Pixee"
        },
        {
          "children": [],
          "description": "A source code analyzer for Java, Salesforce Apex, Javascript, PLSQL, XML, XSL and others.",
          "title": "PMD"
        },
        {
          "children": [],
          "description": "A framework for managing and maintaining multi-language pre-commit hooks.",
          "title": "pre-commit"
        },
        {
          "children": [],
          "description": "Precaution is a static analysis security tool (SAST) designed to find potentially critical vulnerabilities in source code prior to production. It is available as a CLI, GitHub Action, and GitHub App.",
          "title": "Precaution"
        },
        {
          "children": [],
          "description": "An opinionated code formatter.",
          "title": "Prettier"
        },
        {
          "children": [],
          "description": "Quick automated code review of your changes. Supports more than 40 runners for various languages, including Clang, Elixir, JavaScript, PHP, Ruby and more.",
          "title": "Pronto",
          "repo_info": {
            "archived": false,
            "language": "Ruby",
            "last_commit": "2026-02-09T04:34:54Z",
            "owner": "prontolabs",
            "repo": "pronto",
            "stars": 2656
          }
        },
        {
          "children": [],
          "description": "warning: — An engine for searching patterns in the source code, based on Unified AST or UST. At present time C#, Java, PHP, PL/SQL, T-SQL, and JavaScript are supported. Patterns can be described within the code or using a DSL.",
          "title": "PT.PM :warning: — An engine for searching patterns in the source code, based on Unified AST or UST. At present time C#, Java, PHP, PL/SQL, T-SQL, and JavaScript are supported. Patterns can be described within the code or using a DSL."
        },
        {
          "children": [],
          "description": "Pluggable and configurable code transformer with built-in eslint, babel plugins support for js, jsx typescript, flow, markdown, yaml and json.",
          "title": "Putout",
          "repo_info": {
            "archived": false,
            "language": "JavaScript",
            "last_commit": "2026-02-14T23:09:11Z",
            "owner": "coderaiser",
            "repo": "putout",
            "stars": 782
          }
        },
        {
          "children": [],
          "description": "copyright: — A ( for FOSS and individual developers) static analysis of C, C++, C# and Java code. For advertising purposes . Supports CWE mapping, OWASP ASVS, MISRA, AUTOSAR and SEI CERT coding standards.",
          "title": "PVS-Studio",
          "repo_info": {
            "archived": false,
            "language": null,
            "last_commit": "2023-12-08T07:19:41Z",
            "owner": "viva64",
            "repo": "pvs-studio-check-list",
            "stars": 29
          }
        },
        {
          "children": [],
          "description": "Code audit tool for Python and JavaScript. Wraps pycodestyle, pydocstyle, PyFlakes, Mccabe, Pylint, and more",
          "title": "pylama"
        },
        {
          "children": [],
          "description": "copyright: — Identify vulnerabilities that are unique to your code base before they reach production. Leverages the Code Property Graph (CPG) to run its analyses concurrently in a single graph of graphs. Automatically finds business logic flaws in dev like hardcoded secrets and logic bombs",
          "title": "Qwiet AI"
        },
        {
          "children": [],
          "description": "The free Visual Studio 2015 extension for C# and VB.NET refactorings, including code best practice analyzers.",
          "title": "Refactoring Essentials"
        },
        {
          "children": [],
          "description": "A static file linter that allows you to write custom rules using regular expressions (RegEx).",
          "title": "relint",
          "repo_info": {
            "archived": false,
            "language": "Python",
            "last_commit": "2025-12-15T15:28:58Z",
            "owner": "codingjoe",
            "repo": "relint",
            "stars": 65
          }
        },
        {
          "children": [],
          "description": "copyright: — Extends Visual Studio with on-the-fly code inspections for C#, VB.NET, ASP.NET, JavaScript, TypeScript and other technologies.",
          "title": "ReSharper"
        },
        {
          "children": [],
          "description": "Dependency analysis and optimization toolkit for modern JavaScript and TypeScript projects. Trace imports, identify circular dependencies, find unused code, clean node modules.",
          "title": "Rev-dep",
          "repo_info": {
            "archived": false,
            "language": "Go",
            "last_commit": "2026-02-12T16:01:19Z",
            "owner": "jayu",
            "repo": "rev-dep",
            "stars": 36
          }
        },
        {
          "children": [],
          "description": "copyright: — A static source code analyser for vulnerabilities in PHP scripts.",
          "title": "RIPS"
        },
        {
          "children": [],
          "description": "Roslyn-based implementation of FxCop analyzers.",
          "title": "Roslyn Analyzers",
          "repo_info": {
            "archived": false,
            "language": null,
            "last_commit": "2026-02-13T19:24:31Z",
            "owner": "dotnet",
            "repo": "roslyn-analyzers",
            "stars": 1668
          }
        },
        {
          "children": [],
          "description": "Project that focuses on the identification of potential vulnerabilities such as SQL injection, cross-site scripting (XSS), CSRF, cryptography weaknesses, hardcoded passwords and many more.",
          "title": "Roslyn Security Guard"
        },
        {
          "children": [],
          "description": "Validate and auto-generate TypeScript types from raw SQL queries in PostgreSQL. SafeQL is an ESLint plugin for writing SQL queries in a type-safe way.",
          "title": "SafeQL"
        },
        {
          "children": [],
          "description": "copyright: — Check the Android Source code thoroughly to uncover and address potential security concerns and vulnerabilities. Static application security testing (Static Code Analysis) tool Online",
          "title": "SAST Online"
        },
        {
          "children": [],
          "description": "warning: :copyright: — A proprietary code quality checker that can be integrated with GitHub.",
          "title": "Scrutinizer :warning: :copyright: — A proprietary code quality checker that can be integrated with GitHub."
        },
        {
          "children": [],
          "description": "Security code analyzer for C# and VB.NET. Detects various security vulnerability patterns: SQLi, XSS, CSRF, XXE, Open Redirect, etc. Integrates into Visual Studio 2015 and newer. Detects various security vulnerability patterns: SQLi, XSS, CSRF, XXE, Open Redirect, etc.",
          "title": "Security Code Scan"
        },
        {
          "children": [],
          "description": "A fast, open-source, static analysis tool for finding bugs and enforcing code standards at editor, commit, and CI time. Its rules look like the code you already write;  no abstract syntax trees or regex wrestling. Supports 17+ languages.",
          "title": "Semgrep"
        },
        {
          "children": [],
          "description": "copyright: — Quickly find and remediate high-priority security issues.  Semgrep Supply Chain prioritizes the 2% of vulnerabilities that are reachable from your code.",
          "title": "Semgrep Supply Chain"
        },
        {
          "children": [],
          "description": "Security-focused static analyzer for Java and Kotlin web applications. Analyzes bytecode with Semgrep-style YAML rules and CodeQL-grade dataflow (with first-class Spring support) to find vulnerabilities that source-only scanners miss.",
          "title": "Seqra"
        },
        {
          "children": [],
          "description": "Scan is a free open-source DevSecOps platform for detecting security issues in source code and dependencies. It supports a broad range of languages and CI/CD pipelines.",
          "title": "ShiftLeft Scan",
          "repo_info": {
            "archived": false,
            "language": "Python",
            "last_commit": "2023-09-01T12:48:17Z",
            "owner": "ShiftLeftSecurity",
            "repo": "sast-scan",
            "stars": 865
          }
        },
        {
          "children": [],
          "description": "warning: — Static program analysis platform that allows custom analyzers to plug in through a common interface.",
          "title": "shipshape :warning: — Static program analysis platform that allows custom analyzers to plug in through a common interface."
        },
        {
          "children": [],
          "description": "copyright: — Sigrid helps you to improve your software by measuring your system's code quality,  and then compares the results against a benchmark of thousands of industry systems to give you concrete advice on areas where you can improve.",
          "title": "Sigrid"
        },
        {
          "children": [],
          "description": "A tool that finds similarities between or within files to support you encountering DRY principle violations.",
          "title": "Similarity Tester"
        },
        {
          "children": [],
          "description": "copyright: — Snyk Code finds security vulnerabilities based on AI. Its speed of analysis allow us to analyse your code in real time and deliver results when you hit the save button in your IDE. Supported languages are Java, JavaScript, Python, PHP, C#, Go and TypeScript. Integrations with GitHub, BitBucket and Gitlab. It is free to try and part of the Snyk platform also covering SCA, containers and IaC.",
          "title": "Snyk Code"
        },
        {
          "children": [],
          "description": "copyright: — SonarQube Cloud enables your team to deliver clean code consistently and efficiently with a code review  tool that easily integrates into the cloud DevOps platforms and extend your CI/CD workflow.  SonarQube Cloud provides a free plan.",
          "title": "SonarQube Cloud"
        },
        {
          "children": [],
          "description": "SonarQube for IDE (formerly SonarLint) is a free IDE extension available for IntelliJ, VS Code, Visual Studio, and Eclipse,  to find and fix coding issues in real-time, flagging issues as you code, just like a spell-checker.  More than a linter, it also delivers rich contextual guidance to help developers understand  why there is an issue, assess the risk, and educate them on how to fix it.",
          "title": "SonarQube for IDE"
        },
        {
          "children": [],
          "description": "SonarQube empowers development teams with a code quality and security solution that deeply integrates into your enterprise environment; enabling you to deploy clean code consistently and reliably. SonarQube provides a free and open source Community Build.",
          "title": "SonarQube Server"
        },
        {
          "children": [],
          "description": "copyright: — Reports known vulnerabilities in common dependencies and recommends updated packages to minimize breaking changes",
          "title": "Sonatype"
        },
        {
          "children": [],
          "description": "copyright: — Suite of static analysis tools consisting of the three components Sotoarc (Architecture Analysis), Sotograph (Quality Analysis), and Sotoreport (Quality report). Helps find differences between architecture and implementation, interface violations (e.g. external access of private parts of subsystems, detection of all classes, files, packages and subsystems which are strongly coupled by cyclical relationships and more. The Sotograph product family runs on Windows and Linux.",
          "title": "Soto Platform"
        },
        {
          "children": [],
          "description": "copyright: — Static Code Analysis for C/C++, Java, C#, Python, and RPG III and RPG IV versions (including free-form).",
          "title": "SourceMeter"
        },
        {
          "children": [],
          "description": "Performs static analysis on raw SQL queries in your Go code base to surface potential runtime errors. It checks for SQL syntax error, identifies unsafe queries that could potentially lead to SQL injections makes sure column count matches value count in INSERT statements and validates table- and column names.",
          "title": "sqlvet",
          "repo_info": {
            "archived": false,
            "language": "Go",
            "last_commit": "2025-12-12T06:13:34Z",
            "owner": "houqp",
            "repo": "sqlvet",
            "stars": 497
          }
        },
        {
          "children": [],
          "description": "copyright: — Static Reviewer executes code checks according to the most relevant Secure Coding Standards, OWASP, CWE, CVE, CVSS, MISRA, CERT, for 40+ programming languages, using 1000+ built-in validation rules for Security, Deadcode & Best Practices Available a module for Software Composition Analysis (SCA) to find vulnerabilities in open source and third party libraries.",
          "title": "StaticReviewer"
        },
        {
          "children": [],
          "description": "warning: — Combination of multiple linters to install as a GitHub Action.",
          "title": "Super-Linter :warning: — Combination of multiple linters to install as a GitHub Action."
        },
        {
          "children": [],
          "description": "copyright: — Static code analysis tool for Java,C,C++,C#,Go.",
          "title": "Svace"
        },
        {
          "children": [],
          "description": "copyright: — A commercial static analysis platform that allows for scanning of multiple languages (C/C++, Android, C#, Java, JS, PHP, Python, Node.JS, Ruby, Fortran, and Swift).",
          "title": "Synopsys"
        },
        {
          "children": [],
          "description": "copyright: — Static and dynamic analysis tool supporting more than 25 languages and direct IDE integration. Free hosting for Open Source projects available on request. Free academic licenses available.",
          "title": "Teamscale"
        },
        {
          "children": [],
          "description": "Tencent Cloud Code Analysis (TCA for short, code-named CodeDog inside the company early) is a comprehensive platform for code analysis and issue tracking. TCA consist of three components, server, web and client. It integrates of a number of self-developed tools, and also supports dynamic integration of code analysis tools in various programming languages.",
          "title": "TencentCodeAnalysis"
        },
        {
          "children": [],
          "description": "Vulnerability Scanner and Risk Evaluation for containers, serverless and hosts at runtime. ThreatMapper generates runtime BOMs from dependencies and operating system packages, matches against multiple threat feeds, scans for unprotected secrets, and scores issues based on severity and risk-of-exploit.",
          "title": "ThreatMapper",
          "repo_info": {
            "archived": false,
            "language": "TypeScript",
            "last_commit": "2026-01-08T17:51:41Z",
            "owner": "deepfence",
            "repo": "ThreatMapper",
            "stars": 5233
          }
        },
        {
          "children": [],
          "description": "Linter for integrating annotated TODOs with your issue trackers",
          "title": "todocheck",
          "repo_info": {
            "archived": false,
            "language": "Go",
            "last_commit": "2025-08-02T10:09:40Z",
            "owner": "preslavmihaylov",
            "repo": "todocheck",
            "stars": 437
          }
        },
        {
          "children": [],
          "description": "A Simple and Comprehensive Vulnerability Scanner for Containers and other Artifacts, Suitable for CI. Trivy detects vulnerabilities of OS packages (Alpine, RHEL, CentOS, etc.) and application dependencies (Bundler, Composer, npm, yarn, etc.). Checks containers and filesystems.",
          "title": "trivy",
          "repo_info": {
            "archived": false,
            "language": "Go",
            "last_commit": "2026-02-12T14:43:28Z",
            "owner": "aquasecurity",
            "repo": "trivy",
            "stars": 31909
          }
        },
        {
          "children": [],
          "description": "copyright: — Modern repositories include many technologies, each with its own set of linters. With 30+ linters and counting, Trunk makes it dead-simple to identify, install, configure, and run the right linters, static analyzers, and formatters for all your repos.",
          "title": "trunk"
        },
        {
          "children": [],
          "description": "A fast and accurate static analysis solution for C/C++, C#, Lua codes provided by Tencent. Using GPLv3 license.",
          "title": "TscanCode",
          "repo_info": {
            "archived": false,
            "language": "C++",
            "last_commit": "2023-12-25T08:33:11Z",
            "owner": "Tencent",
            "repo": "TscanCode",
            "stars": 2111
          }
        },
        {
          "children": [],
          "description": "Language-independent tool for massive, automatic, programmable refactoring based on simple pattern definitions.",
          "title": "Undebt",
          "repo_info": {
            "archived": true,
            "language": "Python",
            "last_commit": "2021-04-05T13:44:46Z",
            "owner": "Yelp",
            "repo": "undebt",
            "stars": 1628
          }
        },
        {
          "children": [],
          "description": "copyright: — Code visualization tool that provides code analysis, standards testing, metrics, graphing, dependency analysis and more for Ada, VHDL, and others.",
          "title": "Understand"
        },
        {
          "children": [],
          "description": "Universal code beautifier with a GitHub app. Supports HTML, CSS, JavaScript, TypeScript, JSX, Vue, C++, Go, Objective-C, Java, Python, PHP, GraphQL, Markdown, and more.",
          "title": "Unibeautify"
        },
        {
          "children": [],
          "description": "copyright: — Code review tool with static code analysis and code-aware navigation for Java, PHP, JavaScript and Kotlin.",
          "title": "Upsource"
        },
        {
          "children": [],
          "description": "copyright: — Find flaws in binaries and bytecode without requiring source. Support all major programming languages: Java, .NET, JavaScript, Swift, Objective-C, C, C++ and more.",
          "title": "Veracode"
        },
        {
          "children": [],
          "description": "Static analysis capabilities for Java bytecode and related languages and for JavaScript.",
          "title": "WALA",
          "repo_info": {
            "archived": false,
            "language": "Java",
            "last_commit": "2026-02-03T02:46:35Z",
            "owner": "wala",
            "repo": "WALA",
            "stars": 834
          }
        },
        {
          "children": [],
          "description": "A fast and robust semantic search tool for C and C++ codebases. It is designed to help security researchers identify interesting functionality in large codebases.",
          "title": "weggli",
          "repo_info": {
            "archived": false,
            "language": "Rust",
            "last_commit": "2024-07-12T16:50:14Z",
            "owner": "googleprojectzero",
            "repo": "weggli",
            "stars": 2475
          }
        },
        {
          "children": [],
          "description": "copyright: — WhiteHat Scout (for Developers) combined with WhiteHat Sentinel Source (for Operations) supporting WhiteHat Top 40 and OWASP Top 10.",
          "title": "WhiteHat Application Security Platform"
        },
        {
          "children": [],
          "description": "warning: — Pluggable TypeScript and JavaScript linter.",
          "title": "Wotan :warning: — Pluggable TypeScript and JavaScript linter."
        },
        {
          "children": [],
          "description": "copyright: — XCode provides a pretty decent UI for  static code analyzer (C/C++, Obj-C).",
          "title": "XCode"
        },
        {
          "children": [],
          "description": "copyright: — Xygeni is a comprehensive Software Supply Chain Security platform. It provides Advanced SAST with AI-powered remediation, Software Composition Analysis (SCA) with real-time malware detection, Infrastructure as Code (IaC) scanning, and Secrets detection to ensure end-to-end code security.",
          "title": "Xygeni"
        }
      ],
      "title": "Multiple languages"
    },
    {
      "description": "",
      "items": [
        {
          "children": [],
          "description": "A collection of linters in github collections",
          "title": "Clean code linters"
        },
        {
          "children": [],
          "description": "A collection of PHP linters in github collections",
          "title": "Code Quality Checker Tools For PHP Projects"
        },
        {
          "children": [],
          "description": "A collection of tools and libraries for working with Go code, including linters and static analysis",
          "title": "go-tools",
          "repo_info": {
            "archived": false,
            "language": "Go",
            "last_commit": "2026-02-13T18:59:57Z",
            "owner": "dominikh",
            "repo": "go-tools",
            "stars": 6715
          }
        },
        {
          "children": [],
          "description": "An introduction to static code analysis",
          "title": "linters",
          "repo_info": {
            "archived": false,
            "language": null,
            "last_commit": "2026-02-11T02:01:03Z",
            "owner": "mcandre",
            "repo": "linters",
            "stars": 349
          }
        },
        {
          "children": [],
          "description": "List of tools maintained by the Open Web Application Security Project",
          "title": "OWASP Source Code Analysis Tools"
        },
        {
          "children": [],
          "description": "A reviewed list of useful PHP static analysis tools",
          "title": "php-static-analysis-tools",
          "repo_info": {
            "archived": false,
            "language": null,
            "last_commit": "2025-01-28T07:15:33Z",
            "owner": "exakat",
            "repo": "php-static-analysis-tools",
            "stars": 2868
          }
        },
        {
          "children": [],
          "description": "A list of tools for static code analysis.",
          "title": "Wikipedia"
        }
      ],
      "title": "More Collections"
    },
    {
      "description": "To the extent possible under law, Matthias Endler has waived all copyright and related or neighboring rights to this work.\nThe underlying source code used to format and display that content is licensed under the MIT license.\nTitle image Designed by Freepik.",
      "items": [],
      "title": "License"
    }
  ],
  "metadata": {
    "last_updated": "2026-02-15T04:26:47.320Z",
    "original_repository": "analysis-tools-dev/static-analysis",
    "source_repository": "v1nvn/enhansome-static-analysis",
    "source_repository_description": null,
    "title": "Untitled"
  }
}